; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types car - object 
           location - object)

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))

   (:action board
       :parameters (?car - car ?loc - location)
       :precondition (and (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters (?car - car  ?loc - location)
       :precondition (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-93)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 car19 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 loc15 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc1)
    (at car1 loc5)
    (at car2 loc2)
    (at car3 loc13)
    (at car4 loc7)
    (at car5 loc5)
    (at car6 loc2)
    (at car7 loc14)
    (at car8 loc15)
    (at car9 loc14)
    (at car10 loc1)
    (at car11 loc7)
    (at car12 loc9)
    (at car13 loc9)
    (at car14 loc6)
    (at car15 loc6)
    (at car16 loc14)
    (at car17 loc1)
    (at car18 loc3)
    (at car19 loc3)
)
 (:goal (and 
(at car1 loc7)
(at car2 loc10)
(at car3 loc6)
(at car4 loc13)
(at car5 loc4)
(at car6 loc4)
(at car7 loc1)
(at car8 loc7)
(at car9 loc13)
))
)

; plan
1. (sail loc1 loc14)
   deleted: (at-ferry loc1)
   added: (at-ferry loc14)
   goals met: 0 of 9
2. (board car7 loc14)
   deleted: (at car7 loc14) (empty-ferry)
   added: (on car7)
   goals met: 0 of 9
3. (sail loc14 loc1)
   deleted: (at-ferry loc14)
   added: (at-ferry loc1)
   goals met: 0 of 9
4. (debark car7 loc1)
   deleted: (on car7)
   added: (at car7 loc1) (empty-ferry)
   goals met: 1 of 9
5. (sail loc1 loc14)
   deleted: (at-ferry loc1)
   added: (at-ferry loc14)
   goals met: 1 of 9
6. (board car9 loc14)
   deleted: (at car9 loc14) (empty-ferry)
   added: (on car9)
   goals met: 1 of 9
7. (sail loc14 loc13)
   deleted: (at-ferry loc14)
   added: (at-ferry loc13)
   goals met: 1 of 9
8. (debark car9 loc13)
   deleted: (on car9)
   added: (at car9 loc13) (empty-ferry)
   goals met: 2 of 9
9. (board car3 loc13)
   deleted: (at car3 loc13) (empty-ferry)
   added: (on car3)
   goals met: 2 of 9
10. (sail loc13 loc6)
   deleted: (at-ferry loc13)
   added: (at-ferry loc6)
   goals met: 2 of 9
11. (debark car3 loc6)
   deleted: (on car3)
   added: (at car3 loc6) (empty-ferry)
   goals met: 3 of 9
12. (sail loc6 loc15)
   deleted: (at-ferry loc6)
   added: (at-ferry loc15)
   goals met: 3 of 9
13. (board car8 loc15)
   deleted: (at car8 loc15) (empty-ferry)
   added: (on car8)
   goals met: 3 of 9
14. (sail loc15 loc7)
   deleted: (at-ferry loc15)
   added: (at-ferry loc7)
   goals met: 3 of 9
15. (debark car8 loc7)
   deleted: (on car8)
   added: (at car8 loc7) (empty-ferry)
   goals met: 4 of 9
16. (board car4 loc7)
   deleted: (at car4 loc7) (empty-ferry)
   added: (on car4)
   goals met: 4 of 9
17. (sail loc7 loc13)
   deleted: (at-ferry loc7)
   added: (at-ferry loc13)
   goals met: 4 of 9
18. (debark car4 loc13)
   deleted: (on car4)
   added: (at car4 loc13) (empty-ferry)
   goals met: 5 of 9
19. (sail loc13 loc2)
   deleted: (at-ferry loc13)
   added: (at-ferry loc2)
   goals met: 5 of 9
20. (board car2 loc2)
   deleted: (at car2 loc2) (empty-ferry)
   added: (on car2)
   goals met: 5 of 9
21. (sail loc2 loc10)
   deleted: (at-ferry loc2)
   added: (at-ferry loc10)
   goals met: 5 of 9
22. (debark car2 loc10)
   deleted: (on car2)
   added: (at car2 loc10) (empty-ferry)
   goals met: 6 of 9
23. (sail loc10 loc5)
   deleted: (at-ferry loc10)
   added: (at-ferry loc5)
   goals met: 6 of 9
24. (board car1 loc5)
   deleted: (at car1 loc5) (empty-ferry)
   added: (on car1)
   goals met: 6 of 9
25. (sail loc5 loc7)
   deleted: (at-ferry loc5)
   added: (at-ferry loc7)
   goals met: 6 of 9
26. (debark car1 loc7)
   deleted: (on car1)
   added: (at car1 loc7) (empty-ferry)
   goals met: 7 of 9
27. (sail loc7 loc2)
   deleted: (at-ferry loc7)
   added: (at-ferry loc2)
   goals met: 7 of 9
28. (board car6 loc2)
   deleted: (at car6 loc2) (empty-ferry)
   added: (on car6)
   goals met: 7 of 9
29. (sail loc2 loc4)
   deleted: (at-ferry loc2)
   added: (at-ferry loc4)
   goals met: 7 of 9
30. (debark car6 loc4)
   deleted: (on car6)
   added: (at car6 loc4) (empty-ferry)
   goals met: 8 of 9
31. (sail loc4 loc5)
   deleted: (at-ferry loc4)
   added: (at-ferry loc5)
   goals met: 8 of 9
32. (board car5 loc5)
   deleted: (at car5 loc5) (empty-ferry)
   added: (on car5)
   goals met: 8 of 9
33. (sail loc5 loc4)
   deleted: (at-ferry loc5)
   added: (at-ferry loc4)
   goals met: 8 of 9
34. (debark car5 loc4)
   deleted: (on car5)
   added: (at car5 loc4) (empty-ferry)
   goals met: 9 of 9
